{"cc_2_md_a_1_1": ["A zookeeper measured two snakes. One measured 41cm and the other measured 64cm. What was the difference in length between the two snakes?", "A zookeeper measured two snakes. One measured 25cm and the other measured 64cm. What was the difference in length between the two snakes?", "A zookeeper measured two snakes. One measured 15cm and the other measured 25cm. What was the difference in length between the two snakes?"], "cc_2_md_a_1_10": ["Ben is 16cm tall. Mike is 66cm taller than Ben. How tall is Mike?", "Ben is 29cm tall. Mike is 38cm taller than Ben. How tall is Mike?", "Ben is 28cm tall. Mike is 82cm taller than Ben. How tall is Mike?"], "cc_2_md_a_1_11": ["A building is 66 meters tall. A tree near the building is 16 meters tall. How much taller is the building than the tree?", "A building is 99 meters tall. A tree near the building is 38 meters tall. How much taller is the building than the tree?", "A building is 82 meters tall. A tree near the building is 28 meters tall. How much taller is the building than the tree?"], "cc_2_md_a_1_12": ["A whale is 69 feet long. A rhinoceros is 13 feet long. What is the difference in lenght between the whale and the rhinoceros?", "A whale is 28 feet long. A rhinoceros is 26 feet long. What is the difference in lenght between the whale and the rhinoceros?", "A whale is 82 feet long. A rhinoceros is 28 feet long. What is the difference in lenght between the whale and the rhinoceros?"], "cc_2_md_a_1_2": ["My dog is 48cm tall and is 26cm taller than my cat.\nHow tall is my cat?", "My dog is 49cm tall and is 27cm taller than my cat.\nHow tall is my cat?", "My dog is 50cm tall and is 25cm taller than my cat.\nHow tall is my cat?"], "cc_2_md_a_1_3": ["Lia is knitting a scarf. When she begins knitting on Saturday the scarf is 12cm long. By the end of the day it is 39cm long. How many cm of scarf did Lia knit on Saturday?", "Lia is knitting a scarf. When she begins knitting on Saturday the scarf is 25cm long. By the end of the day it is 39cm long. How many cm of scarf did Lia knit on Saturday?", "Lia is knitting a scarf. When she begins knitting on Saturday the scarf is 15cm long. By the end of the day it is 25cm long. How many cm of scarf did Lia knit on Saturday?"], "cc_2_md_a_1_4": ["I had a ball of wool. I cut a 12 cm piece off and had 76cm left. \nHow much wool did I begin with", "I had a ball of wool. I cut a 23 cm piece off and had 25cm left. \nHow much wool did I begin with", "I had a ball of wool. I cut a 15 cm piece off and had 25cm left. \nHow much wool did I begin with"], "cc_2_md_a_1_5": ["Esperanza decides that the tail she has made of her kite is too long and cuts off 11cm. Now the kites' tail is 39cm. How long was the tail to begin with?", "Esperanza decides that the tail she has made of her kite is too long and cuts off 80cm. Now the kites' tail is 90cm. How long was the tail to begin with?", "Esperanza decides that the tail she has made of her kite is too long and cuts off 55cm. Now the kites' tail is 22cm. How long was the tail to begin with?"], "cc_2_md_a_1_6": ["It took 62 small paper clips to measure the length of a bench. It took half as many large paper clips. How many large paper clips did it take?", "It took 18 small paper clips to measure the length of a bench. It took half as many large paper clips. How many large paper clips did it take?", "It took 22 small paper clips to measure the length of a bench. It took half as many large paper clips. How many large paper clips did it take?"], "cc_2_md_a_1_7": ["A baby giraffe was 36 cm tall. Another young giraffe in the enclosure was 100cm tall. How much shorter was the baby giraffe?", "A baby giraffe was 29 cm tall. Another young giraffe in the enclosure was 88cm tall. How much shorter was the baby giraffe?", "A baby giraffe was 22 cm tall. Another young giraffe in the enclosure was 33cm tall. How much shorter was the baby giraffe?"], "cc_2_md_a_1_8": ["I have 3 pencils. The pencils are 17cm, 12cm and 9cm long. What is the total length of all my pencils?", "I have 3 pencils. The pencils are 29cm, 28cm and 12cm long. What is the total length of all my pencils?", "I have 3 pencils. The pencils are 55cm, 44cm and 11cm long. What is the total length of all my pencils?"], "cc_2_md_a_1_9": ["A beaver is 9 inches long. It grows 23 inches. How long is the beaver now?", "A beaver is 19 inches long. It grows 20 inches. How long is the beaver now?", "A beaver is 49 inches long. It grows 16 inches. How long is the beaver now?"]}